&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресВременногоХранилища") Тогда
	
        ОтличающаясяНоменклатура = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
		//Сообщить("test");
		Для каждого СтрТЗ Из ОтличающаясяНоменклатура Цикл
		
			СтрТЧ = Объект.ОтличающаясяНоменклатура.Добавить();
			СтрТЧ.Номенклатура = СтрТЗ.Номенклатура;
			СтрТЧ.Характеристика = СТрТЗ.Характеристика;
			СтрТЧ.Излишек = СтрТЗ.Излишек;
			СтрТЧ.Недостача = СтрТЗ.Недостача; 
		
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры
