&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого элем Из ЭтотОбъект.Параметры.МассивНоменклатуры Цикл
		
		СтрТЧ = Объект.СписокНоменклатуры.Добавить();
		СтрТЧ.Штрихкод = элем.Штрихкод;
		СтрТЧ.Артикул = элем.Артикул;
		СтрТЧ.Номенклатура = элем.Номенклатура;
		СтрТЧ.Характеристика = элем.Характеристика;
		СтрТЧ.Количество = 1;
		СтрТЧ.ЕдиницаИзмерения = элем.ЕдиницаИзмерения;
		СтрТЧ.КоличествоБрака = 0;
		СтрТЧ.ПричинаБрака = Неопределено;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("Штрихкод", Элемент.ТекущиеДанные.Штрихкод);
	ПараметрыЗакрытия.Вставить("Артикул", Элемент.ТекущиеДанные.Артикул);
	ПараметрыЗакрытия.Вставить("Номенклатура", Элемент.ТекущиеДанные.Номенклатура);
	ПараметрыЗакрытия.Вставить("Характеристика", Элемент.ТекущиеДанные.Характеристика);
	ПараметрыЗакрытия.Вставить("Количество", 1);
	ПараметрыЗакрытия.Вставить("ЕдиницаИзмерения", Элемент.ТекущиеДанные.ЕдиницаИзмерения);
	ПараметрыЗакрытия.Вставить("КоличествоБрака", 0);
	ПараметрыЗакрытия.Вставить("ПричинаБрака", Неопределено);
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
КонецПроцедуры
