&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТабличнаяЧасть.Доступность = Ложь;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	i = 0;
	Для каждого рекв Из ОбработкаОбъект.Метаданные().Реквизиты Цикл	
		Элементы.Данные.СписокВыбора.Добавить(i, рекв.Имя);	
		i = i + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РеквизитСуществует = ПроверитьНаличиеСозданногоРеквизита();
	Если РеквизитСуществует Тогда
		СоздатьПолеСТипомОбъекта(ВыбранноеЗначение, Истина);
	Иначе	
		СоздатьПолеСТипомОбъекта(ВыбранноеЗначение);
	КонецЕсли;
	СведенияОТЧ = ПроверитьНаличиеТЧОбъекта();
	Если СведенияОТЧ.ОбъектСодержитТЧ Тогда
		ЗаполнитьСписокВыбораТЧ(СведенияОТЧ.ТабличныеЧасти);			
	Иначе	
		ОтключитьПолеТЧ();	
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура СоздатьПолеСТипомОбъекта(Индекс, ОбновитьТип = Ложь)
	
	Если ОбновитьТип Тогда
		
		МассивУдаляемыхРеквизитов = Новый Массив;
		МассивУдаляемыхРеквизитов.Добавить("Документ");
		ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
		
		ДобавитьРеквизитОбъекта(Индекс);
		
	Иначе
		
		ДобавитьРеквизитОбъекта(Индекс);
		
		ЭлементДокумента = ЭтаФорма.Элементы.Добавить("Документ", Тип("ПолеФормы"), Элементы.Группа1);
		ЭлементДокумента.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДокумента.ПутьКДанным = "Документ";
			
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ДобавитьРеквизитОбъекта(Индекс)
	
	СтрокаРеквизита = Элементы.Данные.СписокВыбора[Индекс].Представление;        	 //
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");                          	 //
	ТипОбъекта = ОбработкаОбъект.Метаданные().Реквизиты[СтрокаРеквизита].Тип;  		 //
	
	МассивРеквизитов = Новый Массив;                                                 //
	ОписаниеТипа = Новый ОписаниеТипов(ТипОбъекта);                                  //
	РеквизитДокумента = Новый РеквизитФормы("Документ", ОписаниеТипа);               //
	МассивРеквизитов.Добавить(РеквизитДокумента);                                    //
	ИзменитьРеквизиты(МассивРеквизитов);                                             //	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеСозданногоРеквизита()

	Попытка
		Реквизит = ЭтаФорма.Документ;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;	

КонецФункции // ()  

&НаСервере
Функция ПроверитьНаличиеТЧОбъекта() 
	ТабличныеЧасти = Новый Структура("ТабличныеЧасти, ОбъектСодержитТЧ");
	МассивТЧ = Новый Массив;
	Если ЭтотОбъект.Документ.Метаданные().ТабличныеЧасти.Количество() > 0 Тогда
		Для каждого ТЧ Из ЭтотОбъект.Документ.Метаданные().ТабличныеЧасти Цикл	
			МассивТЧ.Добавить(ТЧ.Имя);	
		КонецЦикла;
	КонецЕсли;	
	
	Если МассивТЧ.Количество() > 0 Тогда
		ТабличныеЧасти.Вставить("ТабличныеЧасти", МассивТЧ);
		ТабличныеЧасти.Вставить("ОбъектСодержитТЧ", Истина);	
	Иначе	
	    ТабличныеЧасти.Вставить("ТабличныеЧасти", Неопределено);
		ТабличныеЧасти.Вставить("ОбъектСодержитТЧ", Ложь);
	КонецЕсли;
	 
	Возврат ТабличныеЧасти;
	
КонецФункции // ()   

&НаКлиенте
Процедура ЗаполнитьСписокВыбораТЧ(ТабличныеЧасти)
	
	Элементы.ТабличнаяЧасть.СписокВыбора.Очистить();
	Элементы.ТабличнаяЧасть.Доступность = Истина;
	i = 0;
	Для каждого ТЧ Из ТабличныеЧасти Цикл	
		Элементы.ТабличнаяЧасть.СписокВыбора.Добавить(i, ТЧ);	
		i = i + 1;
	КонецЦикла;	

КонецПроцедуры  

&НаСервере
Процедура ОтключитьПолеТЧ()
	
	Элементы.ТабличнаяЧасть.СписокВыбора.Очистить();
	Элементы.ТабличнаяЧасть.Доступность = Ложь;	

КонецПроцедуры


&НаСервере
Процедура ПолучитьРеквизитыОбъектаНаСервере()
	Для каждого рекв Из ЭтотОбъект.Документ.Метаданные().Реквизиты Цикл
		СтрТЧ = Объект.РеквизитыТЧ.Добавить();
		СтрТЧ.Имя = Рекв.Имя; 
		СтрТЧ.Значение = Строка(ЭтотОбъект.Документ[рекв.имя]);
		СтрТЧ.Тип = Строка(Рекв.Тип); 		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРеквизитыОбъекта(Команда)
	РеквизитСуществует = ПроверитьНаличиеСозданногоРеквизита();
	Если РеквизитСуществует Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Документ) Тогда	
			Возврат;
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;
	Объект.РеквизитыТЧ.Очистить();
	ПолучитьРеквизитыОбъектаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыТЧНаСервере() 
	Если ЭтотОбъект.Документ[Элементы.ТабличнаяЧасть.СписокВыбора[ТабличнаяЧасть].Представление].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для каждого рекв Из ЭтотОбъект.Документ.Метаданные().ТабличныеЧасти[Элементы.ТабличнаяЧасть.СписокВыбора[ТабличнаяЧасть].Представление].Реквизиты Цикл
		СтрТЧ = Объект.РеквизитыТЧ.Добавить();
		СтрТЧ.Имя = Рекв.Имя; 
		СтрТЧ.Значение = Строка(ЭтотОбъект.Документ[Элементы.ТабличнаяЧасть.СписокВыбора[ТабличнаяЧасть].Представление][0][рекв.имя]);
		СтрТЧ.Тип = Строка(Рекв.Тип); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРеквизитыТЧ(Команда) 
	СведенияОТЧ = ПроверитьНаличиеТЧОбъекта();
	Если НЕ СведенияОТЧ.ОбъектСодержитТЧ Тогда
		Возврат;				
	КонецЕсли;
	РеквизитСуществует = ПроверитьНаличиеСозданногоРеквизита();
	Если РеквизитСуществует Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Документ) Тогда	
			Возврат;
		КонецЕсли;	
	Иначе
		Возврат;
	КонецЕсли;
	Объект.РеквизитыТЧ.Очистить();
	ПолучитьРеквизитыТЧНаСервере();
КонецПроцедуры


