
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	НЕ Организации.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организации.Наименование ВОЗР";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого СтрР Из Результат Цикл
	
		Организация = Объект.СписокОрганизаций.Добавить();
		Организация.Выбрано = Ложь;
		Организация.Организация = СтрР.Ссылка;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)  
	
	Если НЕ ЗначениеЗаполнено(Объект.СписокОрганизаций) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	МассивОрганизаций = Новый Массив;
	Для каждого СтрТЧ Из Объект.СписокОрганизаций Цикл
	
		Если СтрТЧ.Выбрано Тогда
		
			МассивОрганизаций.Добавить(СтрТЧ.Организация);		
		
		КонецЕсли;	
	
	КонецЦикла; 
	ЭтаФорма.Закрыть(МассивОрганизаций);
КонецПроцедуры
