&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого Склад Из ЭтаФорма.ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Склады Цикл
	
		СкладВТЧ = Объект.СписокСкладов.Добавить();
		СкладВТЧ.Выбрано = Ложь;
		СкладВТЧ.Склад = Склад.Значение;
	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	МассивСкладов = Новый Массив;
	Для каждого СтрТЧ Из Объект.СписокСкладов Цикл
	
		Если СтрТЧ.Выбрано Тогда
		
			МассивСкладов.Добавить(СтрТЧ.Склад);		
		
		КонецЕсли;	
	
	КонецЦикла;
	Если МассивСкладов.Количество() <> 1 Тогда
	
		Сообщить("Выберите один склад.");
		Возврат;
	
	КонецЕсли;
	ЭтаФорма.Закрыть(МассивСкладов[0]);
КонецПроцедуры
