
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	НЕ Склады.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склады.Наименование ВОЗР";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого СтрР Из Результат Цикл
	
		Склад = Объект.СписокСкладов.Добавить();
		Склад.Выбрано = Ложь;
		Склад.Склад = СтрР.Ссылка;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СписокСкладов) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	МассивСкладов = Новый Массив;
	Для каждого СтрТЧ Из Объект.СписокСкладов Цикл
	
		Если СтрТЧ.Выбрано Тогда
		
			МассивСкладов.Добавить(СтрТЧ.Склад);		
		
		КонецЕсли;	
	
	КонецЦикла; 
	ЭтаФорма.Закрыть(МассивСкладов);
КонецПроцедуры
