&НаСервере
Процедура НайтиРазногласияНаСервере()
	Объект.ОтчетОРазногласиях.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания); 
	Запрос.УстановитьПараметр("Поставщик", Объект.Поставщик);
	Запрос.УстановитьПараметр("Получатель", Объект.Получатель);
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|		        	ПеремещениеТоваров.Ссылка КАК СсылкаПеремещение,
|		        	ПеремещениеТоваров.Дата КАК Дата,
|		        	ПеремещениеТоваров.ЗаказНаПеремещение КАК ЗаказНаПеремещение
|		        ПОМЕСТИТЬ Перемещения
|		        ИЗ
|		        	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
|		        ГДЕ
|		        	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
|					И &Alternative
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	Перемещения.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	Перемещения.Дата КАК Дата,
|		        	ПриходныйОрдерНаТовары.Ссылка КАК СсылкаПриход
|		        ПОМЕСТИТЬ ПриходникиРаспПеремещение
|		        ИЗ
|		        	Перемещения КАК Перемещения
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
|		        		ПО Перемещения.СсылкаПеремещение.Ссылка = ПриходныйОрдерНаТовары.Распоряжение.Ссылка
|		        ГДЕ
|		        	НЕ ПриходныйОрдерНаТовары.ПометкаУдаления
|		        	
|		        ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ
|		        	Перемещения.СсылкаПеремещение,
|		        	Перемещения.Дата,
|		        	ПриходныйОрдерНаТовары.Ссылка
|		        ИЗ
|		        	Перемещения КАК Перемещения
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
|		        		ПО Перемещения.ЗаказНаПеремещение.Ссылка = ПриходныйОрдерНаТовары.Распоряжение.Ссылка
|		        ГДЕ
|		        	НЕ ПриходныйОрдерНаТовары.ПометкаУдаления
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	РасходныйОрдерНаТовары.Ссылка КАК Ссылка,
|		        	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение
|		        ПОМЕСТИТЬ РасходникиСРаспоряжениями
|		        ИЗ
|		        	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
|		        		ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = РасходныйОрдерНаТовары.Ссылка
|		        ГДЕ
|		        	НЕ РасходныйОрдерНаТовары.ПометкаУдаления
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	РасходникиСРаспоряжениями.Ссылка КАК Ссылка,
|		        	РасходникиСРаспоряжениями.Распоряжение КАК Распоряжение
|		        ПОМЕСТИТЬ РасходникиРаспЗаказы
|		        ИЗ
|		        	РасходникиСРаспоряжениями КАК РасходникиСРаспоряжениями
|		        ГДЕ
|		        	ТИПЗНАЧЕНИЯ(РасходникиСРаспоряжениями.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	РасходникиСРаспоряжениями.Ссылка КАК Ссылка,
|		        	РасходникиСРаспоряжениями.Распоряжение КАК Распоряжение
|		        ПОМЕСТИТЬ РасходникиРаспПерем
|		        ИЗ
|		        	РасходникиСРаспоряжениями КАК РасходникиСРаспоряжениями
|		        ГДЕ
|		        	ТИПЗНАЧЕНИЯ(РасходникиСРаспоряжениями.Распоряжение) = ТИП(Документ.ПеремещениеТоваров)
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	Перемещения.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	РасходникиРаспЗаказы.Ссылка КАК СсылкаРасход
|		        ПОМЕСТИТЬ РасходникиРаспЗаказыПеределанные
|		        ИЗ
|		        	Перемещения КАК Перемещения
|		        		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходникиРаспЗаказы КАК РасходникиРаспЗаказы
|		        		ПО Перемещения.ЗаказНаПеремещение.Ссылка = РасходникиРаспЗаказы.Распоряжение.Ссылка
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	РасходникиРаспЗаказыПеределанные.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	РасходникиРаспЗаказыПеределанные.СсылкаРасход КАК СсылкаРасход
|		        ПОМЕСТИТЬ РасходникиРаспПеремещение
|		        ИЗ
|		        	РасходникиРаспЗаказыПеределанные КАК РасходникиРаспЗаказыПеределанные
|		        
|		        ОБЪЕДИНИТЬ
|		        
|		        ВЫБРАТЬ
|		        	РасходникиРаспПерем.Распоряжение,
|		        	РасходникиРаспПерем.Ссылка
|		        ИЗ
|		        	РасходникиРаспПерем КАК РасходникиРаспПерем
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	РасходникиРаспПеремещение.СсылкаРасход КАК СсылкаРасход,
|		        	ПриходникиРаспПеремещение.СсылкаПриход КАК СсылкаПриход,
|		        	ПриходникиРаспПеремещение.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	РасходникиРаспПеремещение.СсылкаПеремещение КАК СсылкаПеремещение1
|		        ПОМЕСТИТЬ РасходникиИПриходники
|		        ИЗ
|		        	РасходникиРаспПеремещение КАК РасходникиРаспПеремещение
|		        		ПОЛНОЕ СОЕДИНЕНИЕ ПриходникиРаспПеремещение КАК ПриходникиРаспПеремещение
|		        		ПО РасходникиРаспПеремещение.СсылкаПеремещение = ПриходникиРаспПеремещение.СсылкаПеремещение
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	Перемещения.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	Перемещения.Дата КАК Дата,
|		        	РасходникиИПриходники.СсылкаПриход КАК СсылкаПриход
|		        ПОМЕСТИТЬ ПеремещенияИПриходники
|		        ИЗ
|		        	Перемещения КАК Перемещения
|		        		ЛЕВОЕ СОЕДИНЕНИЕ РасходникиИПриходники КАК РасходникиИПриходники
|		        		ПО Перемещения.СсылкаПеремещение = РасходникиИПриходники.СсылкаПеремещение
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	ПеремещенияИПриходники.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ПеремещенияИПриходники.СсылкаПриход КАК СсылкаПриход,
|		        	ПеремещенияИПриходники.Дата КАК Дата,
|		        	РасходникиИПриходники.СсылкаРасход КАК СсылкаРасход
|		        ПОМЕСТИТЬ ПеремещенияРасходПриход
|		        ИЗ
|		        	ПеремещенияИПриходники КАК ПеремещенияИПриходники
|		        		ЛЕВОЕ СОЕДИНЕНИЕ РасходникиИПриходники КАК РасходникиИПриходники
|		        		ПО ПеремещенияИПриходники.СсылкаПеремещение = РасходникиИПриходники.СсылкаПеремещение1
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ
|		        	АктОРасхожденияхПослеПеремещения.Ссылка КАК Ссылка,
|		        	АктОРасхожденияхПослеПеремещенияТовары.ДокументОснование КАК ДокументОснование
|		        ПОМЕСТИТЬ АктыОРасхожденияхСПеремещениями
|		        ИЗ
|		        	Документ.АктОРасхожденияхПослеПеремещения.Товары КАК АктОРасхожденияхПослеПеремещенияТовары
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПеремещения КАК АктОРасхожденияхПослеПеремещения
|		        		ПО АктОРасхожденияхПослеПеремещенияТовары.Ссылка = АктОРасхожденияхПослеПеремещения.Ссылка
|		        ГДЕ
|		        	НЕ АктОРасхожденияхПослеПеремещения.ПометкаУдаления
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|		        	ПеремещенияРасходПриход.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ПеремещенияРасходПриход.Дата КАК ПеремещениеДата,
|		        	ПеремещенияРасходПриход.СсылкаПриход КАК СсылкаПриход,
|		        	ПеремещенияРасходПриход.СсылкаРасход КАК СсылкаРасход,
|		        	АктыОРасхожденияхСПеремещениями.Ссылка КАК СсылкаРасхождение,
|		        	ПеремещенияРасходПриход.СсылкаПеремещение.СкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	ПеремещенияРасходПриход.СсылкаПеремещение.СкладПолучатель КАК СсылкаПеремещениеСкладПолучатель
|		        ПОМЕСТИТЬ ОсновныеДанные
|		        ИЗ
|		        	ПеремещенияРасходПриход КАК ПеремещенияРасходПриход
|		        		ЛЕВОЕ СОЕДИНЕНИЕ АктыОРасхожденияхСПеремещениями КАК АктыОРасхожденияхСПеремещениями
|		        		ПО ПеремещенияРасходПриход.СсылкаПеремещение = АктыОРасхожденияхСПеремещениями.ДокументОснование
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ОсновныеДанные.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ОсновныеДанные.СсылкаПриход КАК СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход КАК СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
|		        	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
|		        	СУММА(ПриходныйОрдерНаТоварыТовары.Количество) КАК Количество
|		        ПОМЕСТИТЬ ПриходТовары
|		        ИЗ
|		        	ОсновныеДанные КАК ОсновныеДанные
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
|		        		ПО ОсновныеДанные.СсылкаПриход = ПриходныйОрдерНаТоварыТовары.Ссылка
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	ОсновныеДанные.СсылкаПеремещение,
|		        	ОсновныеДанные.СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение,
|		        	ПриходныйОрдерНаТоварыТовары.Номенклатура,
|		        	ПриходныйОрдерНаТоварыТовары.Характеристика
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ОсновныеДанные.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ОсновныеДанные.СсылкаПриход КАК СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход КАК СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
|		        	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
|		        	СУММА(РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество) КАК Количество
|		        ПОМЕСТИТЬ РасходТовары
|		        ИЗ
|		        	ОсновныеДанные КАК ОсновныеДанные
|		        		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
|		        		ПО ОсновныеДанные.СсылкаРасход = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	ОсновныеДанные.СсылкаПеремещение,
|		        	ОсновныеДанные.СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение,
|		        	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура,
|		        	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ РАЗЛИЧНЫЕ
|		        	ОсновныеДанные.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ОсновныеДанные.ПеремещениеДата КАК ПеремещениеДата,
|		        	ОсновныеДанные.СсылкаПриход КАК СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход КАК СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	ОсновныеДанные.СсылкаПеремещениеСкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	ОсновныеДанные.СсылкаПеремещениеСкладПолучатель КАК СсылкаПеремещениеСкладПолучатель,
|		        	ПриходТовары.Номенклатура КАК Номенклатура,
|		        	ПриходТовары.Характеристика КАК Характеристика,
|		        	ПриходТовары.Количество КАК КоличествоПриход,
|		        	0 КАК КоличествоРасход
|		        ПОМЕСТИТЬ ОбъединенныеТовары
|		        ИЗ
|		        	ОсновныеДанные КАК ОсновныеДанные
|		        		ЛЕВОЕ СОЕДИНЕНИЕ ПриходТовары КАК ПриходТовары
|		        		ПО ОсновныеДанные.СсылкаПриход = ПриходТовары.СсылкаПриход
|		        
|		        ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ РАЗЛИЧНЫЕ
|		        	ОсновныеДанные.СсылкаПеремещение,
|		        	ОсновныеДанные.ПеремещениеДата,
|		        	ОсновныеДанные.СсылкаПриход,
|		        	ОсновныеДанные.СсылкаРасход,
|		        	ОсновныеДанные.СсылкаРасхождение,
|		        	ОсновныеДанные.СсылкаПеремещениеСкладОтправитель,
|		        	ОсновныеДанные.СсылкаПеремещениеСкладПолучатель,
|		        	РасходТовары.Номенклатура,
|		        	РасходТовары.Характеристика,
|		        	0,
|		        	РасходТовары.Количество
|		        ИЗ
|		        	ОсновныеДанные КАК ОсновныеДанные
|		        		ЛЕВОЕ СОЕДИНЕНИЕ РасходТовары КАК РасходТовары
|		        		ПО ОсновныеДанные.СсылкаРасход = РасходТовары.СсылкаРасход
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ОбъединенныеТовары.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ОбъединенныеТовары.ПеремещениеДата КАК ПеремещениеДата,
|		        	ОбъединенныеТовары.СсылкаПриход КАК СсылкаПриход,
|		        	ОбъединенныеТовары.СсылкаРасход КАК СсылкаРасход,
|		        	ОбъединенныеТовары.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	ОбъединенныеТовары.Номенклатура КАК Номенклатура,
|		        	ОбъединенныеТовары.Характеристика КАК Характеристика,
|		        	СУММА(ОбъединенныеТовары.КоличествоПриход) КАК КоличествоПриход,
|		        	СУММА(ОбъединенныеТовары.КоличествоРасход) КАК КоличествоРасход,
|		        	ОбъединенныеТовары.СсылкаПеремещениеСкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	ОбъединенныеТовары.СсылкаПеремещениеСкладПолучатель КАК СсылкаПеремещениеСкладПолучатель
|		        ПОМЕСТИТЬ СгруппированныеТовары
|		        ИЗ
|		        	ОбъединенныеТовары КАК ОбъединенныеТовары
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	ОбъединенныеТовары.СсылкаПриход,
|		        	ОбъединенныеТовары.СсылкаРасход,
|		        	ОбъединенныеТовары.Номенклатура,
|		        	ОбъединенныеТовары.Характеристика,
|		        	ОбъединенныеТовары.СсылкаПеремещениеСкладОтправитель,
|		        	ОбъединенныеТовары.СсылкаПеремещениеСкладПолучатель,
|		        	ОбъединенныеТовары.СсылкаПеремещение,
|		        	ОбъединенныеТовары.ПеремещениеДата,
|		        	ОбъединенныеТовары.СсылкаРасхождение
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	СгруппированныеТовары.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	СгруппированныеТовары.Номенклатура КАК Номенклатура,
|		        	СгруппированныеТовары.Характеристика КАК Характеристика,
|		        	СгруппированныеТовары.ПеремещениеДата КАК ПеремещениеДата,
|		        	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ДатаЦена,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель.УчетныйВидЦены КАК ВидЦены
|		        ПОМЕСТИТЬ ВТ_ДанныеМДата
|		        ИЗ
|		        	СгруппированныеТовары КАК СгруппированныеТовары
|		        		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
|		        		ПО СгруппированныеТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
|		        			И СгруппированныеТовары.Характеристика = ЦеныНоменклатуры.Характеристика
|		        			И СгруппированныеТовары.ПеремещениеДата >= ЦеныНоменклатуры.Период
|		        			И СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель.УчетныйВидЦены = ЦеныНоменклатуры.ВидЦены
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	СгруппированныеТовары.СсылкаПеремещение,
|		        	СгруппированныеТовары.Номенклатура,
|		        	СгруппированныеТовары.Характеристика,
|		        	СгруппированныеТовары.ПеремещениеДата,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель.УчетныйВидЦены
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ВТ_ДанныеМДата.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ВТ_ДанныеМДата.Номенклатура КАК Номенклатура,
|		        	ВТ_ДанныеМДата.Характеристика КАК Характеристика,
|		        	ВТ_ДанныеМДата.ПеремещениеДата КАК ПеремещениеДата,
|		        	ВТ_ДанныеМДата.ВидЦены КАК ВидЦены,
|		        	ЦеныНоменклатуры.Цена КАК Цена
|		        ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
|		        ИЗ
|		        	ВТ_ДанныеМДата КАК ВТ_ДанныеМДата
|		        		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
|		        		ПО ВТ_ДанныеМДата.Номенклатура = ЦеныНоменклатуры.Номенклатура
|		        			И ВТ_ДанныеМДата.Характеристика = ЦеныНоменклатуры.Характеристика
|		        			И ВТ_ДанныеМДата.ДатаЦена = ЦеныНоменклатуры.Период
|		        			И ВТ_ДанныеМДата.ВидЦены = ЦеныНоменклатуры.ВидЦены
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	СгруппированныеТовары.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	СгруппированныеТовары.ПеремещениеДата КАК ПеремещениеДата,
|		        	СгруппированныеТовары.СсылкаПриход КАК СсылкаПриход,
|		        	СгруппированныеТовары.СсылкаРасход КАК СсылкаРасход,
|		        	СгруппированныеТовары.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	СУММА(ВЫБОР
|		        			КОГДА СгруппированныеТовары.КоличествоПриход - СгруппированныеТовары.КоличествоРасход > 0
|		        				ТОГДА СгруппированныеТовары.КоличествоПриход - СгруппированныеТовары.КоличествоРасход
|		        			ИНАЧЕ 0
|		        		КОНЕЦ) КАК Излишки,
|		        	СУММА(ВЫБОР
|		        			КОГДА СгруппированныеТовары.КоличествоРасход - СгруппированныеТовары.КоличествоПриход > 0
|		        				ТОГДА СгруппированныеТовары.КоличествоРасход - СгруппированныеТовары.КоличествоПриход
|		        			ИНАЧЕ 0
|		        		КОНЕЦ) КАК Недостачи,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладПолучатель КАК СсылкаПеремещениеСкладПолучатель,
|		        	СУММА(СгруппированныеТовары.КоличествоПриход * ВТ_ЦеныНоменклатуры.Цена) - СУММА(СгруппированныеТовары.КоличествоРасход * ВТ_ЦеныНоменклатуры.Цена) КАК Разность,
|		        	СгруппированныеТовары.СсылкаПеремещение.ПометкаУдаления КАК ПеремещениеУдалено,
|		        	СгруппированныеТовары.СсылкаПриход.Проведен КАК ПриходПроведен,
|		        	СгруппированныеТовары.СсылкаРасход.Проведен КАК РасходПроведен,
|		        	ЛОЖЬ КАК Повтор
|		        ПОМЕСТИТЬ ВТ_ПолныйНаборДанных
|		        ИЗ
|		        	СгруппированныеТовары КАК СгруппированныеТовары
|		        		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
|		        		ПО СгруппированныеТовары.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
|		        			И СгруппированныеТовары.Характеристика = ВТ_ЦеныНоменклатуры.Характеристика
|		        			И СгруппированныеТовары.СсылкаПеремещение = ВТ_ЦеныНоменклатуры.СсылкаПеремещение
|		        			И СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель.УчетныйВидЦены = ВТ_ЦеныНоменклатуры.ВидЦены
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	СгруппированныеТовары.СсылкаПеремещение,
|		        	СгруппированныеТовары.ПеремещениеДата,
|		        	СгруппированныеТовары.СсылкаПриход,
|		        	СгруппированныеТовары.СсылкаРасход,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладОтправитель,
|		        	СгруппированныеТовары.СсылкаПеремещениеСкладПолучатель,
|		        	СгруппированныеТовары.СсылкаРасхождение,
|		        	СгруппированныеТовары.СсылкаПеремещение.ПометкаУдаления
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеДата КАК ПеремещениеДата,
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход КАК СсылкаПриход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасход КАК СсылкаРасход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	ВТ_ПолныйНаборДанных.Излишки КАК Излишки,
|		        	ВТ_ПолныйНаборДанных.Недостачи КАК Недостачи,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладПолучатель КАК СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_ПолныйНаборДанных.Разность КАК Разность,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеУдалено КАК ПеремещениеУдалено,
|		        	ВТ_ПолныйНаборДанных.ПриходПроведен КАК ПриходПроведен,
|		        	ВТ_ПолныйНаборДанных.РасходПроведен КАК РасходПроведен
|		        ПОМЕСТИТЬ ВТ_Набор
|		        ИЗ
|		        	ВТ_ПолныйНаборДанных КАК ВТ_ПолныйНаборДанных
|		        ГДЕ
|		        	(ВТ_ПолныйНаборДанных.Излишки <> 0
|		        			ИЛИ ВТ_ПолныйНаборДанных.Недостачи <> 0)
|		        
|		        ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещение,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеДата,
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасхождение,
|		        	ВТ_ПолныйНаборДанных.Излишки,
|		        	ВТ_ПолныйНаборДанных.Недостачи,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_ПолныйНаборДанных.Разность,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеУдалено,
|		        	ВТ_ПолныйНаборДанных.ПриходПроведен,
|		        	ВТ_ПолныйНаборДанных.РасходПроведен
|		        ИЗ
|		        	ВТ_ПолныйНаборДанных КАК ВТ_ПолныйНаборДанных
|		        ГДЕ
|		        	ВТ_ПолныйНаборДанных.Излишки = 0
|		        	И ВТ_ПолныйНаборДанных.Недостачи = 0
|		        	И НЕ ВТ_ПолныйНаборДанных.СсылкаРасхождение ЕСТЬ NULL
|		        
|		        ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещение,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеДата,
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасхождение,
|		        	ВТ_ПолныйНаборДанных.Излишки,
|		        	ВТ_ПолныйНаборДанных.Недостачи,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_ПолныйНаборДанных.Разность,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеУдалено,
|		        	ВТ_ПолныйНаборДанных.ПриходПроведен,
|		        	ВТ_ПолныйНаборДанных.РасходПроведен
|		        ИЗ
|		        	ВТ_ПолныйНаборДанных КАК ВТ_ПолныйНаборДанных
|		        ГДЕ
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход ЕСТЬ NULL
|		        	И ВТ_ПолныйНаборДанных.СсылкаРасход ЕСТЬ NULL
|		        	И ВТ_ПолныйНаборДанных.СсылкаПеремещение.Проведен
|		        	
|		        	ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещение,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеДата,
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасхождение,
|		        	ВТ_ПолныйНаборДанных.Излишки,
|		        	ВТ_ПолныйНаборДанных.Недостачи,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_ПолныйНаборДанных.Разность,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеУдалено,
|		        	ВТ_ПолныйНаборДанных.ПриходПроведен,
|		        	ВТ_ПолныйНаборДанных.РасходПроведен
|		        ИЗ
|		        	ВТ_ПолныйНаборДанных КАК ВТ_ПолныйНаборДанных
|		        ГДЕ
|		        	НЕ ВТ_ПолныйНаборДанных.СсылкаПриход.Проведен
|		        	ИЛИ НЕ ВТ_ПолныйНаборДанных.СсылкаРасход.Проведен
|		        	И НЕ ВТ_ПолныйНаборДанных.СсылкаПеремещение.ПометкаУдаления 
|		        	
|		        	ОБЪЕДИНИТЬ ВСЕ
|		        
|		        ВЫБРАТЬ
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещение,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеДата,
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасход,
|		        	ВТ_ПолныйНаборДанных.СсылкаРасхождение,
|		        	ВТ_ПолныйНаборДанных.Излишки,
|		        	ВТ_ПолныйНаборДанных.Недостачи,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_ПолныйНаборДанных.СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_ПолныйНаборДанных.Разность,
|		        	ВТ_ПолныйНаборДанных.ПеремещениеУдалено,
|		        	ВТ_ПолныйНаборДанных.ПриходПроведен,
|		        	ВТ_ПолныйНаборДанных.РасходПроведен
|		        ИЗ
|		        	ВТ_ПолныйНаборДанных КАК ВТ_ПолныйНаборДанных
|		        	
|		        ГДЕ
|		        	ВТ_ПолныйНаборДанных.СсылкаПриход.Проведен
|		        	И ВТ_ПолныйНаборДанных.СсылкаРасход.Проведен
|		        	И НЕ ВТ_ПолныйНаборДанных.СсылкаПеремещение.Проведен
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ВТ_Набор.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	КОЛИЧЕСТВО(ВТ_Набор.СсылкаПеремещение) КАК КоличествоДублей
|		        ПОМЕСТИТЬ ВТ_Дубли
|		        ИЗ
|		        	ВТ_Набор КАК ВТ_Набор
|		        
|		        СГРУППИРОВАТЬ ПО
|		        	ВТ_Набор.СсылкаПеремещение
|		        
|		        ИМЕЮЩИЕ
|		        	КОЛИЧЕСТВО(ВТ_Набор.СсылкаПеремещение) > 1
|		        ;
|		        
|		        ////////////////////////////////////////////////////////////////////////////////
|		        ВЫБРАТЬ
|		        	ВТ_Набор.СсылкаПеремещение КАК СсылкаПеремещение,
|		        	ВТ_Набор.ПеремещениеДата КАК ПеремещениеДата,
|		        	ВТ_Набор.СсылкаПриход КАК СсылкаПриход,
|		        	ВТ_Набор.СсылкаРасход КАК СсылкаРасход,
|		        	ВТ_Набор.СсылкаРасхождение КАК СсылкаРасхождение,
|		        	ВТ_Набор.Излишки КАК Излишки,
|		        	ВТ_Набор.Недостачи КАК Недостачи,
|		        	ВТ_Набор.СсылкаПеремещениеСкладОтправитель КАК СсылкаПеремещениеСкладОтправитель,
|		        	ВТ_Набор.СсылкаПеремещениеСкладПолучатель КАК СсылкаПеремещениеСкладПолучатель,
|		        	ВТ_Набор.Разность КАК Разность,
|		        	ВТ_Набор.СсылкаПеремещение.Проведен КАК ПеремещениеПроведено,
|		        	ВТ_Набор.ПеремещениеУдалено КАК ПеремещениеУдалено,
|		        	ВТ_Набор.ПриходПроведен КАК ПриходПроведен,
|		        	ВТ_Набор.РасходПроведен КАК РасходПроведен,
|		        	ВЫБОР
|		        		КОГДА ВТ_Дубли.КоличествоДублей > 1
|		        			ТОГДА ИСТИНА
|		        		ИНАЧЕ ЛОЖЬ
|		        	КОНЕЦ КАК Повтор
|		        ИЗ
|		        	ВТ_Набор КАК ВТ_Набор
|		        		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дубли КАК ВТ_Дубли
|		        		ПО ВТ_Набор.СсылкаПеремещение = ВТ_Дубли.СсылкаПеремещение
|	
|";



	
	//Все
	Если ЗначениеЗаполнено(Объект.Поставщик) И ЗначениеЗаполнено(Объект.Получатель) Тогда
		
		ТекстЗапроса = СтрЗаменить(Текст, "И &Alternative",
		"И ПеремещениеТоваров.СкладОтправитель = &Поставщик
		|	И ПеремещениеТоваров.СкладПолучатель = &Получатель");
		
		//+Поставщик -Получатель
	ИначеЕсли ЗначениеЗаполнено(Объект.Поставщик) И НЕ ЗначениеЗаполнено(Объект.Получатель) Тогда
		
		ТекстЗапроса = СтрЗаменить(Текст, "И &Alternative",
		"И ПеремещениеТоваров.СкладОтправитель = &Поставщик");
		
		//-Поставщик +Получатель	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Поставщик) И ЗначениеЗаполнено(Объект.Получатель) Тогда  
		
		ТекстЗапроса = СтрЗаменить(Текст, "И &Alternative",
		"И ПеремещениеТоваров.СкладПолучатель = &Получатель");
		
		//Ничего	
	Иначе
		
		ТекстЗапроса = СтрЗаменить(Текст, "И &Alternative",
		"");
		
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрТЧ = Объект.ОтчетОРазногласиях.Добавить();
		СтрТЧ.РасходныйОрдер = Выборка.СсылкаРасход;
		СтрТЧ.ПриходныйОрдер = Выборка.СсылкаПриход; 
		СтрТЧ.Перемещение = Выборка.СсылкаПеремещение;
		СтрТЧ.АктОРасхождении = Выборка.СсылкаРасхождение;
		СтрТЧ.Поставщик = Выборка.СсылкаПеремещениеСкладОтправитель;
		СтрТЧ.Получатель = Выборка.СсылкаПеремещениеСкладПолучатель; 
		СтрТЧ.Недостача = Выборка.Недостачи;
		СтрТЧ.Излишки = Выборка.Излишки; 
		СтрТЧ.Разность = Выборка.Разность;
		СтрТЧ.Повтор = Выборка.Повтор;
		СтрТЧ.Дата = Выборка.ПеремещениеДата;
		СтрТЧ.ПеремещениеПроведено = Выборка.ПеремещениеПроведено;
		СтрТЧ.ПеремещениеУдалено = Выборка.ПеремещениеУдалено;
		СтрТЧ.ПриходПроведен = Выборка.ПриходПроведен;
		СтрТЧ.РасходПроведен = Выборка.РасходПроведен;
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиРазногласия(Команда)	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		
		Сообщить("Заполните период.");
		Возврат;
		
	КонецЕсли; 
	НайтиРазногласияНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// заполняем период
	Объект.Период.ДатаНачала = ТекущаяДата() - 60 * 60 * 24 * 365;
	Объект.Период.ДатаОкончания = ТекущаяДата(); 	
КонецПроцедуры                                      

&НаКлиенте
Процедура СортироватьТабЧасть(Команда)
	ИмяКолонки = СтрЗаменить(Элементы.ОтчетОРазногласиях1.ТекущийЭлемент.Имя, "ОтчетОРазногласиях1", "");
	Объект.ОтчетОРазногласиях.Сортировать(ИмяКолонки + " " + Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОРазногласиях1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	Данные = Новый Структура;
	Склады = Новый Массив;
	Склады.Добавить(Элемент.ТекущиеДанные.Получатель);
	Склады.Добавить(Элемент.ТекущиеДанные.Поставщик);
	Данные.Вставить("Расходник", Элемент.ТекущиеДанные.РасходныйОрдер);
	Данные.Вставить("Приходник", Элемент.ТекущиеДанные.ПриходныйОрдер);
	Данные.Вставить("Расхождение", Элемент.ТекущиеДанные.АктОРасхождении);
	Данные.Вставить("Перемещение", Элемент.ТекущиеДанные.Перемещение);  
	Данные.Вставить("Склады", Склады);
	Данные.Вставить("Поставщик", Элемент.ТекущиеДанные.Поставщик);
	Данные.Вставить("ДатаНачала", Объект.Период.ДатаНачала);
	Данные.Вставить("ДатаОкончания", Объект.Период.ДатаОкончания);
	ОткрытьФорму("ВнешняяОбработка.ОтчетОРазногласиях.Форма.ФормаСРасхождениями",Данные,,Истина,,,,РежимОткрытияОкнаФормы.Независимый);
	
	ОчиститьСообщения();
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеВыделенныеНаСервере(ПеремещениеСсылка)
	
	ДокОбП = ПеремещениеСсылка.ПолучитьОбъект();
	
	Попытка
		
		ДокОбП.УстановитьПометкуУдаления(Истина);	
		
	Исключение
		
		Возврат;
		
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеВыделенные(Команда)
	Для каждого Индекс Из Элементы.ОтчетОРазногласиях1.ВыделенныеСтроки Цикл 
		ТекСтр = Элементы.ОтчетОРазногласиях1.ДанныеСтроки(Индекс);
		ПометитьНаУдалениеВыделенныеНаСервере(ТекСтр.Перемещение);
	КонецЦикла;
	// обновляем таблицу
	
	НайтиРазногласияНаСервере();
КонецПроцедуры

&НаСервере
Функция ПоказатьДок()
	
	ТабДок = Новый ТабличныйДокумент;
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Разногласия");
	облШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(облШапка); 
	облФильтры = Макет.ПолучитьОбласть("Фильтры");
	облФильтры.Параметры.Период = ?(ЗначениеЗаполнено(Объект.Период), Объект.Период, "-");
	облФильтры.Параметры.Поставщик = ?(ЗначениеЗаполнено(Объект.Поставщик), Объект.Поставщик, "-");
	облФильтры.Параметры.Получатель = ?(ЗначениеЗаполнено(Объект.Получатель), Объект.Получатель, "-");
	ТабДок.Вывести(облФильтры); 
	облСтрПустая = Макет.ПолучитьОбласть("СтрПустая");
	Для Счетчик = 0 По 1 Цикл
		ТабДок.Вывести(облСтрПустая);
	КонецЦикла;
	облСтолбцы = Макет.ПолучитьОбласть("Столбцы");
	ТабДок.Вывести(облСтолбцы); 
	облСтрТЧ = Макет.ПолучитьОбласть("СтрТЧ");
	Для каждого СтрТЧ Из Объект.ОтчетОРазногласиях Цикл
		
		облСтрТЧ.Параметры.Дата = СтрТЧ.Дата;
		облСтрТЧ.Параметры.Перемещение = СтрТЧ.Перемещение;
		облСтрТЧ.Параметры.РасходныйОрдер = СтрТЧ.РасходныйОрдер;
		облСтрТЧ.Параметры.ПриходныйОрдер = СтрТЧ.ПриходныйОрдер;
		облСтрТЧ.Параметры.АктОРасхождении = СтрТЧ.АктОРасхождении;
		облСтрТЧ.Параметры.Поставщик = СтрТЧ.Поставщик;
		облСтрТЧ.Параметры.Получатель = СтрТЧ.Получатель;
		облСтрТЧ.Параметры.Недостача = СтрТЧ.Недостача;
		облСтрТЧ.Параметры.Излишки = СтрТЧ.Излишки;
		облСТрТЧ.Параметры.Разность = СтрТЧ.Разность;
		ТабДок.Вывести(облСтрТЧ);
		
	КонецЦикла;
	Возврат ТабДок;
	//ТабДок.Показать("Разногласия | " + Строка(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy")));	
	
КонецФункции

&НаКлиенте
Процедура ЭкспортВExcel(Команда)
	ТабДок = ПоказатьДок();
	ТабДок.Показать("Разногласия | " + Строка(Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy")));
КонецПроцедуры

&НаСервере
Процедура ПровестиВыделенныеНаСервере(Ссылка)
	ДокОбП = Ссылка.ПолучитьОбъект();
	
	Если ДокОбП.ПометкаУдаления Тогда
	
		Сообщить("Документ " + Строка(ДокОбП) + " помечен на удаление, проведение невозможно!");	
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ДокОбП.Записать(РежимЗаписиДокумента.Проведение);	
		Сообщить("Документ " + Строка(ДокОбП) + " успешно проведен!");
		
	Исключение
		
		Сообщить("Документ " + Строка(ДокОбП) + " не удалось провести.");
		Возврат;
		
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиВыделенные(Команда)
	
	СчетчикИзменений = Ложь;
	Для каждого Индекс Из Элементы.ОтчетОРазногласиях1.ВыделенныеСтроки Цикл
		ТекСтр = Элементы.ОтчетОРазногласиях1.ДанныеСтроки(Индекс);
		Если ЗначениеЗаполнено(ТекСтр.Перемещение) И НЕ ТекСтр.ПеремещениеПроведено И НЕ ТекСтр.ПеремещениеУдалено Тогда
			ПровестиВыделенныеНаСервере(ТекСтр.Перемещение);
			СчетчикИзменений = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтр.ПриходныйОрдер) И НЕ ТекСтр.ПриходПроведен Тогда
			ПровестиВыделенныеНаСервере(ТекСтр.ПриходныйОрдер);
			СчетчикИзменений = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтр.РасходныйОрдер) И НЕ ТекСтр.РасходПроведен Тогда
			ПровестиВыделенныеНаСервере(ТекСтр.РасходныйОрдер);
			СчетчикИзменений = Истина;
		КонецЕсли;	
	КонецЦикла; 
	// обновляем таблицу
	Если СчетчикИзменений Тогда
		НайтиРазногласияНаСервере();	
	КонецЕсли;
	
КонецПроцедуры   

